[
    {
        "id": "1",
        "name": "Injury Tracker",
        "type": "Full stack",
        "tech": "React, HTML, CSS, Javascript, Express, MongoDB, Auth0, Github pages, Vercel",
        "api": "A backend service to read and write injury data into a MongoDB database.",
        "desc": "A simple Injury tracking web application that simplifies the process of recording, managing, and analyzing injuries and incidents.",
        "links": {
            "github": "https://github.com/girish-n7/injury-tracker",
            "live": "https://girish-n7.github.io/injury-tracker"
        }
    },
    {
        "id": "2",
        "name": "Summarizer",
        "type": "Full stack",
        "tech": "React, HTML, CSS, Javascript, Express, Github pages, Vercel",
        "api": "A reliable backend service to support the summarizer project, enabling efficient processing of content and delivering concise and coherent summaries. Hosted on Vercel.",
        "desc": "A user-friendly and responsive web application that efficiently condenses lengthy content into concise summaries, enhancing information accessibility and user convenience.",
        "links": {
            "github": "https://github.com/girish-n7/summarizer",
            "live": "https://girish-n7.github.io/summarizer"
        }
    },
    {
        "id": "3",
        "name": "Chatbot",
        "type": "Full stack",
        "api": "A sophisticated backend service to power the AI chatbot, facilitating natural and engaging conversations while managing data seamlessly. Hosted on Vercel.",
        "tech": "React, OpenAI API, HTML, CSS, Javascript, Express, Github Pages, Vercel",
        "desc": "An AI chatbot infused with the distinctive speech style of Batman, creating a unique and immersive conversational experience.",
        "links": {
            "github": "https://github.com/girish-n7/chatbot",
            "live": "https://girish-n7.github.io/chatbot"
        }
    },
    {
        "id": "4",
        "name": "e-commerce website",
        "type": "Full stack",
        "tech": "React, HTML, CSS, Javascript, Express, Github pages, Vercel",
        "api": "A backend service to fetch items, search by product id and serve products by category",
        "desc": "An e-commerce website where users can explore items, shop by category, add/ remove items from wishlist and a cart service that users can checkout to get a cart summary",
        "links": {
            "github": "https://github.com/girish-n7/e-commerce",
            "live": "https://girish-n7.github.io/e-commerce"
        }
    },
    {
        "id": "5",
        "name": "Portfolio",
        "type": "Frontend only",
        "tech": "React, HTML, CSS, Javascript, Github pages",
        "desc": "A standout portfolio project showcasing my skills in web development, featuring interactive and responsive designs, seamless navigation, and a seamless blend of front-end and back-end technologies.",
        "links": {
            "github": "https://github.com/girish-n7/portfolio",
            "live": "https://girish-n7.github.io/portfolio"
        }
    },
    {
        "id": "6",
        "name": "Quiz mobile",
        "type": "Full stack",
        "tech": "React Native, Javascript, Express, MongoDB, Vercel",
        "desc": "Project description",
        "links": {
            "github": "https://github.com/girish-n7/quiz",
            "live": "https://github.com/girish-n7/quiz"
        }
    },
    {
        "id": "7",
        "name": "Contact API",
        "type": "Backend only",
        "tech": "Express, NodeJS, Vercel, MongoDB",
        "desc": "A versatile API catering to contact forms across my personal projects, seamlessly writing data to a private database for real-time monitoring of new entries."
    }
]